

const artistNames = [
    "יוסי אלפנט", "מאיר אריאל", "בועז שרעבי", "אדי בטלר", "מירי אלוני",
    "ערן צור", "רבקה זהר", "נתן גושן", "נסרין קדרי", "שמוליק קראוס",
    "נגה ארז", "רייסקינדר", "מיקה קרני", "ירמי קפלן", "אמיר דדון",
    "גיא מזיג", "שרון חזיז", "רונית שחר", "אביב גפן", "אפרת גוש",
    "יוני בלוך", "עברי לידר", "קרן פלס", "דוד דאור", "אריק ברמן",
    "עילי בוטנר", "גלעד כהנא", "עופר ניסים", "דנה אינטרנשיונל", "מירי מסיקה",
    "חמי רודנר", "אביתר בנאי", "שירי מימון", "מיכל אמדורסקי", "דניאל סלומון",
    "עידן רייכל", "נרקיס (זמרת)", "איה זהבי פייגלין", "אושר כהן", "נועה קירל",
    "אודיה", "עלמה גוב", "גבע אלון", "תומר ישעיהו", "נועם רותם",
    "שי צברי", "דודו טסה", "שלומי סרנגה", "דקלון", "חיים משה",
    "נתי לוי", "רון שובל", "אלי לוזון", "ג'קי מקייטן", "אבי פרץ",
    "שריף הילד הדרוזי", "קובי פרץ", "משה פרץ", "סמיר שוקרי", "שלומי שבן",
    "פיני חדד", "יואב יצחק (זמר)", "עופר לוי", "ליאור נרקיס", "חנן בן ארי",
    "שחר טבוך", "אביב גדג", "גבריאל בלחסן", "ענבל ביבי", "אנה זק",
    "אביהו פנחסוב"
];


artistNamesEncoded = [];

artistNames.forEach(name => {
    let encoded = encodeURIComponent(name).split('').join('');
    artistNamesEncoded.push(encoded);
})

console.log(artistNamesEncoded);